[
    {
        "title": "gem5 Vision",
        "start": "January 2023",
        "end": "June 2023",
        "description": "Created an infrastructure for gem5 Resources for the Senior Design project as a team.\nImplemented advanced search functionality to enhance resource discovery within the gem5 ecosystem.\nIntroduced semantic versioning and built a comprehensive resource categorization system for easy access to resources.\nExpanded gem5’s database support by integrating local and remote JSON files as well as MongoDB, improving efficiency and user accessibility.\nCurrently the database handles 1.2 million+ requests a month and the website has 20,000+ visitors a month.",
        "skills": [
            "NextJS",
            "MongoDB",
            "Python",
            "JSON Schema"
        ],
        "links": {
            "Website": "https://resources.gem5.org/",
            "Poster": "https://www.gem5.org/assets/files/workshop-isca-2023/posters/gem5-vision-poster.pdf",
            "GitHub": "https://github.com/gem5/gem5-resources-website"
        },
        "image": "/images/gem5vision.png"
    },
    {
        "title": "QuixFolio",
        "start": "March 2023",
        "end": "April 2023",
        "description": "Demonstrated strong coding and programming skills to create QuixFolio as an open-source project.\nStreamlined the portfolio creation process by providing a wide range of customizable templates and easy information input options.\nImplemented hosting capabilities on GitHub pages, enabling seamless portfolio sharing and accessibility.\nSuccessfully launched the alpha version of QuixFolio, which garnered significant traction with over 190 visitors and 1000+ page views within the first week.",
        "skills": [
            "ReactJS",
            "NextJS",
            "Material UI",
            "GitHub Pages",
            "GitHub Actions"
        ],
        "links": {
            "Website": "https://quixfolio.vercel.app/"
        },
        "image": "/images/quixfolio.webp"
    },
    {
        "title": "L-Store Database Implementation",
        "start": "January 2023",
        "end": "March 2023",
        "description":"Collaborated with team members to develop a multi-threaded Python-based L-Store database with support for essential functionalities such as search, insert, update, sum, and delete queries.\nEnsured data integrity and persistence by incorporating disk writing mechanisms, safeguarding critical information against system failures or crashes.\nUtilized a BTree data structure to efficiently index and organize data, enhancing the database’s search and retrieval operations for faster response times.",
        "skills":[
            "Python",
            "Multi-threading"
        ],
        "links": {
            "GitHub": "https://github.com/wohmas/165A_group"
        },
        "image": "/images/l-store.png"
    },
    {
        "title": "UNIfy - Course Assistant",
        "start": "January 2022",
        "end": "January 2022",
        "description": "Utilized the UC Davis Schedule Builder API to extract class timings and professors.\nFormulated a class-based hierarchized dictionary to maintain schedules of over 100 server members in five Discord servers.\nExtracted data from APIs of Rate My Professor and Google Calendar to add additional features to the bot.\nSolidified skills of good software design to understand and solve problem domain.",
        "skills": [
            "Discord Bot",
            "Python",
            "JavaScript"
        ],
        "image": "/images/unify.png",
        "links": {
            "Blog Post": "/blogs/unifycourseassistant"
        }
    }
]